{
    "NAV": {
        "why_me": "Warum ich",
        "skills": "Fähigkeiten",
        "my_work": "Meine Arbeiten",
        "contact": "Kontakt"
    },
    "WHY_ME": {
        "why_me": "Warum ich",
        "description": "Ich bin motiviert, kontinuierlich neue Technologien zu lernen und mich weiterzuentwickeln. Meine Fähigkeit, komplexe Probleme zu lösen, und meine Leidenschaft für Programmierung machen mich zu einem wertvollen Mitglied in Ihrem Team.",
        "i_am": "Ich bin",
        "location": "Standort in Bischofswiesen",
        "remote": "Offen für Remote-Arbeit",
        "relocate": "Bereit umzuziehen",
        "contact_me": "Kontaktieren Sie mich"
    },
    "SKILLS": {
        "my_skills": "Fähigkeiten",
        "description": "Die IT-Landschaft entwickelt sich ständig weiter, mit neuen Technologien und Methoden. Um motiviert zu bleiben und meine IT-Fähigkeiten zu erweitern, braucht es einen strategischen Ansatz, eine neugierige Denkweise und ein Engagement für lebenslanges Lernen.",
        "challenge": "Fordere mich heraus",
        "new_tech": "Ich freue mich immer, neue Technologien zu lernen. Sagen Sie mir einfach, was Sie brauchen.",
        "learn_new_tech": "Ich versuche immer, meine aktuellen Fähigkeiten zu erweitern und freue mich, neue Technologien zu lernen. Sagen sie mir einfach, was sie noch benötigen."
    },
    "WORK": {
        "my_work": "Meine Arbeiten",
        "about": "Über das Projekt",
        "about_description_project_1": "Task-Manager, inspiriert vom Kanban-System. Erstelle und organisiere Aufgaben mit Drag-and-Drop-Funktionen, weise Benutzer und Kategorien zu.",
        "about_description_project_2": "Ein Jump-and-Run-Spiel basierend auf einem objektorientierten Ansatz. Hilf Pepe, gegen gefährliche Feinde zu kämpfen und den mächtigen Endboss zu besiegen.",
        "about_description_project_3": "Eine Anwendung, die auf einer REST-API basiert und eine Übersicht aller Pokémon anzeigt. Die Daten werden dabei direkt aus der PokéAPI abgerufen.",
        "tech": "Technologien, die ich verwendet habe",
        "tech-description_project_1": "JavaScript, HTML, CSS, Firebase",
        "tech-description_project_2": "JavaScript, HTML, CSS, Firebase",
        "tech-description_project_3": "REST-API, JavaScript, HTML, CSS",
        "learned": "Was ich gelernt habe",
        "learned_description_project_1": "Durch meine Arbeit an Join habe ich wertvolle Erfahrungen in der effizienten Integration einer Datenbank mit Firebase sowie in der Implementierung einer zuverlässigen Login-Funktion gesammelt. Besonders die Teamarbeit hat mir gezeigt, wie wichtig klare Kommunikation und der gezielte Einsatz von Git für eine erfolgreiche Zusammenarbeit sind.",
        "learned_description_project_2": "Durch meine Arbeit an El Pollo Loco habe ich wertvolle Einblicke in den Aufbau von 2D-Spielen mit Canvas gewonnen und mein Verständnis der objektorientierten Programmierung weiter vertieft. Dieses Projekt hat nicht nur meine Kreativität gefordert, sondern mich auch gelehrt, komplexe Logik in überschaubare Module zu zerlegen.",
        "learned_description_project_3": "Ich habe gelernt, Daten strukturiert abzurufen und benutzerfreundlich aufzubereiten, wodurch sich meine Fähigkeiten in JavaScript und CSS erheblich verbessert haben.",
        "live": "Live",
        "ongoing": "Laufendes Projekt",
        "ongoing_description": "Ich entwickle derzeit eine professionelle Website für ein Elektrofachunternehmen, das sich auf den Bau sowie die Wartung elektrischer Anlagen spezialisiert hat. Dabei lege ich besonderen Wert auf eine moderne, benutzerfreundliche Gestaltung und eine klare Struktur, um die Dienstleistungen des Unternehmens optimal zu präsentieren.",
        "lets_talk": "Lass uns reden"
    },
    "REF": {
        "references": "Referenzen",
        "mobile_title": "Brauchen Sie einen Teamplayer?",
        "mobile_sub_title": "Hier ist, was meine Kollegen über mich sagen.",
        "description_card_1": "Die Zusammenarbeit mit Denis war immer angenehm und bereichernd. Gleichzeitig Er überzeugte durch seine Lernbereitschaft und seinen Ehrgeiz, sich neuen Herausforderungen zu stellen.",
        "description_card_2": "Denis war eine echte Bereicherung für unser gemeinsames Projekt. Die Kommunikation zu Projektanforderungen erfolgte stets klar, zeitnah und unkompliziert.",
        "description_card_3": " Seine strukturierte Herangehensweise, sein Engagement und seine Fähigkeit, auch komplexe Herausforderungen effizient zu lösen, haben das Projekt maßgeblich vorangebracht."
    },
    "CONTACT": {
        "contact_me": "Kontaktiere mich",
        "let_us": "Lass uns zusammenarbeiten",
        "description": "Ob dein Projekt die Entwicklung einer neuen Anwendung, die Aktualisierung bestehender Systeme oder die Implementierung robuster Cybersicherheitsmaßnahmen umfasst, ich besitze die technische Kompetenz und Problemlösungsfähigkeiten, um erfolgreiche Ergebnisse sicherzustellen.",
        "legal_notice": "Rechtshinweis",
        "policy": "Datenschutzrichtlinie",
        "read":"Ich habe die",
        "agree": "gelesen und stimme der Verarbeitung",
        "myData": "meiner Daten gemäß den darin enthaltenen Bestimmungen zu.",
        "placeholderName": "Dein Name",
        "placeholderMail": "Deine e-mail",
        "placeholderMessage": "Deine Nachicht",
        "submit": "Senden"
    },
    
    "PRIVACY": {
      "title": "Datenschutzrichtlinie",
      "general_info": {
        "title": "1. Datenschutz auf einen Blick",
        "description": "Die folgenden Hinweise geben einen einfachen Überblick darüber, was mit Ihren personenbezogenen Daten passiert, wenn Sie diese Website besuchen. Personenbezogene Daten sind alle Daten, mit denen Sie persönlich identifiziert werden können. Ausführliche Informationen zum Thema Datenschutz entnehmen Sie unserer unter diesem Text aufgeführten Datenschutzerklärung."
      },
      "data_collection": {
        "title": "2. Datenerfassung auf dieser Website",
        "responsible": "Wer ist verantwortlich für die Datenerfassung auf dieser Website?",
        "how": "Wie erfassen wir Ihre Daten?",
        "purpose": "Wofür nutzen wir Ihre Daten?",
        "rights": "Welche Rechte haben Sie bezüglich Ihrer Daten?"
      },
      "hosting": {
        "title": "3. Hosting",
        "provider": "All-Inkl",
        "details": "Der Anbieter ist ALL-INKL.COM - Neue Medien Münnich."
      },
      "data_protection": {
        "title": "Datenschutz",
        "description": "Die Betreiber dieser Seiten nehmen den Schutz Ihrer persönlichen Daten sehr ernst. Wir behandeln Ihre personenbezogenen Daten vertraulich und entsprechend den gesetzlichen Datenschutzvorschriften sowie dieser Datenschutzerklärung."
      },
      "responsible_entity": {
        "title": "Hinweis zur verantwortlichen Stelle",
        "description": "Die verantwortliche Stelle für die Datenverarbeitung auf dieser Website ist: Denis Dudda, Böckelweiherstrasse 5, 83483 Bischofswiesen, Telefon: +49 (0) 1733267162, E-Mail: denis.d@hotmail.de"
      },
      "storage_duration": {
        "title": "Speicherdauer",
        "description": "Soweit innerhalb dieser Datenschutzerklärung keine speziellere Speicherdauer genannt wurde, verbleiben Ihre personenbezogenen Daten bei uns, bis der Zweck für die Datenverarbeitung entfällt."
      },
      "legal_basis": {
        "title": "Rechtsgrundlagen der Datenverarbeitung",
        "description": "Sofern Sie in die Datenverarbeitung eingewilligt haben, verarbeiten wir Ihre personenbezogenen Daten auf Grundlage von Art. 6 Abs. 1 lit. a DSGVO. Sind Ihre Daten zur Vertragserfüllung erforderlich, verarbeiten wir diese auf Grundlage von Art. 6 Abs. 1 lit. b DSGVO."
      },
      "consent_withdrawal": {
        "title": "Widerruf Ihrer Einwilligung zur Datenverarbeitung",
        "description": "Viele Datenverarbeitungsvorgänge sind nur mit Ihrer ausdrücklichen Einwilligung möglich. Sie können eine bereits erteilte Einwilligung jederzeit widerrufen."
      },
      "complaint_right": {
        "title": "Beschwerderecht bei der zuständigen Aufsichtsbehörde",
        "description": "Im Falle von Verstößen gegen die DSGVO steht Ihnen ein Beschwerderecht bei einer Aufsichtsbehörde zu."
      },
      "data_transfer": {
        "title": "Recht auf Datenübertragbarkeit",
        "description": "Sie haben das Recht, Daten, die wir auf Grundlage Ihrer Einwilligung oder in Erfüllung eines Vertrags automatisiert verarbeiten, an sich oder an einen Dritten in einem gängigen, maschinenlesbaren Format aushändigen zu lassen."
      },
      "access_correction_deletion": {
        "title": "Auskunft, Berichtigung und Löschung",
        "description": "Sie haben jederzeit das Recht auf unentgeltliche Auskunft über Ihre gespeicherten personenbezogenen Daten sowie ein Recht auf Berichtigung oder Löschung dieser Daten."
      },
      "processing_restriction": {
        "title": "Recht auf Einschränkung der Verarbeitung",
        "description": "Sie haben das Recht, die Einschränkung der Verarbeitung Ihrer personenbezogenen Daten zu verlangen."
      }
    }
 }


