{
    "NAV":{
        "why_me": "Why me",
        "skills": "skills",
        "my_work": "My Work",
        "contact": "Contact"
    },
    "WHY_ME": {
        "why_me": "Why me",
        "description": "I am motivated to continuously learn new technologies and develop myself. My ability to solve complex problems and my passion for programming make me a valuable member of your team.",
        "i_am": "i am",
        "location" : "Located in Bischofswiesen",
        "remote": "Open to work remote",
        "relocate": "Open to relocate",
        "contact_me": "Contact me" 
    },
    "SKILLS":{
        "my_skills": "My Skill Set",
        "description": "The IT landscape is continuously evolving, with new technologies and methodologies. Staying motivated to expand my IT skills requires a strategic approach, a curious mindset, and a commitment to lifelong learning.",
        "challenge": "Challenge me",
        "new_tech": "I am always happy to learn new technologies, just tell me what you need.",
        "learn_new_tech": "I always try to expamd my current skill set and  I am happy to learn new technologies, just tell me what else do you need."
    },
    "WORK":{
        "my_work": "My Work",
        "about": "About the Project",
        "about_description_project_1": "Task Manager, inspired by the Kanban system. Create and organize tasks with drag-and-drop functionality, assign users and categories.",
        "about_description_project_2": "A jump-and-run game based on an object-oriented approach. Help Pepe fight dangerous enemies and defeat the powerful final boss.",
        "about_description_project_3": "An application based on a REST API that displays an overview of all Pokémon. The data is retrieved directly from the PokéAPI.",
        "tech": "Technologies i have used",
        "tech-description_project_1": "JavaScript, HTML, CSS, Firebase",
        "tech-description_project_2": "JavaScript, HTML, CSS, Firebase",
        "tech-description_project_3": "REST-API, JavaScript, HTML, CSS",
        "learned": "What i have learned",
        "learned_description_project_1": "Through my work on Join, I gained valuable experience in efficiently integrating a database with Firebase and implementing a reliable login function. Working in a team especially taught me how crucial clear communication and the targeted use of Git are for successful collaboration.",
        "learned_description_project_2": "Through my work on El Pollo Loco, I gained valuable insights into building 2D games with Canvas and further deepened my understanding of object-oriented programming. This project not only challenged my creativity but also taught me how to break down complex logic into manageable modules.",
        "learned_description_project_3": "I learned how to retrieve data in a structured way and present it in a user-friendly manner, which significantly improved my JavaScript and CSS skills.",
        "live": "Live",
        "ongoing": "Ongoing Project",
        "ongoing_description": "I am currently developing a professional website for an electrical company specializing in construction and maintenance of electrical systems. My focus is on creating a modern, user-friendly design with a clear structure to effectively showcase the company's services.",
        "lets_talk": "Let s Talk"
    },
    "REF":{
        "references": "References",
        "mobile_title": "Need a teamplayer?",
        "mobile_sub_title": "Here what my colleagues said about me",
        "description_card_1": "Working with Denis was always pleasant and enriching. At the same time, he impressed with his eagerness to learn and his determination to take on new challenges.",
        "description_card_2": "Denis was a real asset to our joint project. Communication regarding project requirements was always clear, timely, and straightforward.",
        "description_card_3": "His structured approach, dedication, and ability to efficiently solve even complex challenges significantly advanced the project."
    },
    "CONTACT":{
        "contact_me": "Contact me",
        "let_us": "Let us work together",
        "description": "Whether your project involves developing a new application, upgrading existing systems, or implementing robust cybersecurity measures, I have the technical acumen and problem-solving skills to ensure successful outcomes.",
        "legal_notice": "Legal noctice",
        "policy": "Privacy policy",
        "read":"I've read the",
        "agree": "and agree to the processing",
        "myData": "of my data as outlined.",
        "placeholderName": "Your Name",
        "placeholderMail": "Your e-mail",
        "placeholderMessage": "Your message",
        "submit": "Submit"
    },
"PRIVACY": {
    "title": "Privacy Policy",
    "general_info": {
      "title": "1. Data Protection at a Glance",
      "description": "The following information provides a simple overview of what happens to your personal data when you visit this website. Personal data is any information that can be used to identify you personally. Detailed information on the subject of data protection can be found in our privacy policy below this text."
    },
    "data_collection": {
      "title": "2. Data Collection on this Website",
      "responsible": "Who is responsible for the data collection on this website?",
      "how": "How do we collect your data?",
      "purpose": "What do we use your data for?",
      "rights": "What rights do you have regarding your data?"
    },
    "hosting": {
      "title": "3. Hosting",
      "provider": "All-Inkl",
      "details": "The provider is ALL-INKL.COM - Neue Medien Münnich."
    },
    "data_protection": {
      "title": "Data Protection",
      "description": "The operators of these pages take the protection of your personal data very seriously. We treat your personal data confidentially and in accordance with the legal data protection regulations and this privacy policy."
    },
    "responsible_entity": {
      "title": "Notice to the Responsible Entity",
      "description": "The responsible entity for data processing on this website is: Denis Dudda, Böckelweiherstrasse 5, 83483 Bischofswiesen, Phone: +49 (0) 1733267162, E-mail: denis.d@hotmail.de"
    },
    "storage_duration": {
      "title": "Storage Duration",
      "description": "As long as no more specific storage duration is stated in this privacy policy, your personal data will remain with us until the purpose for data processing is no longer applicable."
    },
    "legal_basis": {
      "title": "Legal Basis of Data Processing",
      "description": "If you have given consent to the data processing, we process your personal data based on Art. 6 (1) lit. a of the GDPR. If your data is required for the fulfillment of a contract, we process it based on Art. 6 (1) lit. b of the GDPR."
    },
    "consent_withdrawal": {
      "title": "Withdrawal of Your Consent to Data Processing",
      "description": "Many data processing operations are only possible with your explicit consent. You can withdraw your consent at any time."
    },
    "complaint_right": {
      "title": "Right to Lodge a Complaint with the Supervisory Authority",
      "description": "In case of violations of the GDPR, you have the right to lodge a complaint with a supervisory authority."
    },
    "data_transfer": {
      "title": "Right to Data Portability",
      "description": "You have the right to have data that we process automatically based on your consent or in the fulfillment of a contract handed over to you or to a third party in a commonly used, machine-readable format."
    },
    "access_correction_deletion": {
      "title": "Right to Access, Rectification, and Deletion",
      "description": "You have the right to obtain free information about your stored personal data at any time, as well as the right to correct or delete this data."
    },
    "processing_restriction": {
      "title": "Right to Restrict Processing",
      "description": "You have the right to request the restriction of the processing of your personal data."
    }
  },
  "LEGAL": {
    "legalNotice": "Legal notice",
    "contact": "Contact",
    "phone": "Phone"
  }
}